{
  "caseStudies": [
    {
      "slug": "ssa-icp",
      "title": "Reducing workflow friction in a high-volume internal system",
      "client": "SSA · Interactive Communication Processing (ICP)",
      "images": [
        {
          "src": "/assets/portfolio/ssa-icp-workflow.png",
          "alt": "ICP workflow diagram showing progressive disclosure and step-by-step process",
          "caption": "Redesigned workflow breaking complex tasks into clear, predictable steps"
        },
        {
          "src": "/assets/portfolio/ssa-icp-interface.png",
          "alt": "ICP interface showing document preview and validation",
          "caption": "Preview and validation interface reducing errors before document generation"
        }
      ],
      "sections": [
        {
          "heading": "Context & Stakes",
          "content": [
            "SSA staff use internal systems to generate official communications that directly affect the public. When those systems are difficult to use or error-prone, the consequences are real — delays, rework, and loss of confidence.",
            "I was brought in to design a clearer, more reliable document-creation experience that supported staff under real operational constraints while meeting strict accessibility and compliance requirements."
          ]
        },
        {
          "heading": "Key Design Decisions",
          "content": [],
          "bullets": [
            "Broke a complex workflow into clear, predictable steps",
            "Used progressive disclosure to manage cognitive load",
            "Prioritized preview and validation before document generation",
            "Aligned UI patterns with SSA standards and accessibility requirements"
          ]
        },
        {
          "heading": "Research & Insight",
          "content": [
            "Usability research revealed where the system was asking users to compensate for poor structure — particularly during template selection, data entry, and final review. These breakdowns directly informed design decisions."
          ]
        },
        {
          "heading": "Accessibility",
          "content": [
            "Accessibility was treated as a baseline design constraint, informing layout, interaction patterns, focus order, and content structure from the start."
          ]
        },
        {
          "heading": "Outcome",
          "content": [
            "The redesigned workflow improved task confidence, reduced perceived complexity, and supported more reliable document creation during usability testing."
          ]
        },
        {
          "heading": "Reflection",
          "content": [
            "Clarity isn't about simplifying reality — it's about supporting people within it."
          ]
        }
      ]
    },
    {
      "slug": "ssa-design-system",
      "title": "Creating consistency and accessibility at enterprise scale",
      "client": "Social Security Administration · Enterprise UX Design System",
      "images": [
        {
          "src": "/assets/portfolio/ssa-design-system-components.png",
          "alt": "SSA design system component library showing buttons, forms, and navigation patterns",
          "caption": "Reusable component library ensuring consistency across applications"
        },
        {
          "src": "/assets/portfolio/ssa-design-system-documentation.png",
          "alt": "Design system documentation showing accessibility guidelines and usage patterns",
          "caption": "Comprehensive documentation supporting cross-team adoption"
        }
      ],
      "sections": [
        {
          "heading": "Context",
          "content": [
            "The Social Security Administration needed a unified design system to ensure consistency and accessibility across dozens of internal and public-facing applications. Without shared standards, teams were duplicating effort and creating inconsistent experiences.",
            "I contributed to building and documenting a scalable design system that could serve diverse teams while maintaining strict accessibility and compliance standards."
          ]
        },
        {
          "heading": "Focus Areas",
          "content": [],
          "bullets": [
            "Component library design and documentation",
            "Accessibility standards and testing protocols",
            "Pattern libraries for common workflows",
            "Cross-team collaboration and adoption support"
          ]
        },
        {
          "heading": "Outcome",
          "content": [
            "The design system provided teams with reusable, accessible components and clear guidance, reducing design and development time while improving consistency across SSA's digital ecosystem."
          ]
        },
        {
          "heading": "Reflection",
          "content": [
            "Good systems work quietly in the background, enabling teams to focus on solving problems rather than reinventing solutions."
          ]
        }
      ]
    },
    {
      "slug": "dol-womens-bureau",
      "title": "Modernizing a public platform without breaking trust",
      "client": "U.S. Department of Labor · Women's Bureau",
      "images": [
        {
          "src": "/assets/portfolio/dol-womens-bureau-ia.png",
          "alt": "Information architecture diagram showing restructured content hierarchy",
          "caption": "Restructured information architecture providing clearer paths to content"
        },
        {
          "src": "/assets/portfolio/dol-womens-bureau-templates.png",
          "alt": "Accessible page templates for the Women's Bureau website",
          "caption": "Consistent, accessible templates improving editorial workflows"
        }
      ],
      "sections": [
        {
          "heading": "Context",
          "content": [
            "The Women's Bureau website serves a broad public audience seeking research, programs, and resources related to women in the workforce. The legacy site was difficult to navigate, content-heavy, and challenging to maintain.",
            "I supported the Drupal 8 modernization by focusing on content structure, accessibility, and long-term sustainability — balancing public needs with internal editorial workflows."
          ]
        },
        {
          "heading": "Focus Areas",
          "content": [],
          "bullets": [
            "Content audit and restructuring",
            "Clear, predictable information hierarchy",
            "Accessible and consistent page templates",
            "Improved CMS workflows for editors"
          ]
        },
        {
          "heading": "Outcome",
          "content": [
            "The modernized site gave users clearer paths to information while giving internal teams a more stable, maintainable content foundation."
          ]
        },
        {
          "heading": "Reflection",
          "content": [
            "Public-facing systems earn trust through clarity, consistency, and care."
          ]
        }
      ]
    }
  ]
}
