{
  "backend/main.mo": "Actor managing projects and resumes with add and query functions backed by Map collections.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing structure, features, and updates across the app.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, typography, and utility classes for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and attaching it to the root element.",
  "frontend/src/App.tsx": "Main app component switching between landing and case study views with smooth-scroll navigation.",
  "frontend/src/components/site/ContactLinks.tsx": "Contact button group for email, resume, and LinkedIn using shared Button and ResumeCta components.",
  "frontend/src/components/site/Motion.tsx": "RevealOnScroll component animating elements into view using IntersectionObserver with reduced‑motion support.",
  "frontend/src/components/site/Primitives.tsx": "Section and Container layout primitives providing consistent spacing and width constraints.",
  "frontend/src/components/site/ResumeCta.tsx": "Resume download button that checks static asset availability and falls back to a disabled state if missing.",
  "frontend/src/components/site/sections/AboutSection.tsx": "About section rendering updated bio text with scroll‑reveal animation.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Hero section displaying wordmark, updated strategic messaging, and CTAs with background image styling.",
  "frontend/src/components/site/sections/LetsTalkSection.tsx": "Contact section with heading, short prompt, and ContactLinks rendered with scroll‑reveal.",
  "frontend/src/components/site/sections/SelectedWorkSection.tsx": "Displays a list of projects as clickable cards that navigate to case studies with scroll animations.",
  "frontend/src/components/site/sections/ValuePropsSection.tsx": "Renders value proposition items from site content in a responsive grid with scroll reveal effects.",
  "frontend/src/components/site/SiteFooter.tsx": "Simple footer with attribution, styling, and responsive layout container.",
  "frontend/src/components/site/SiteHeader.tsx": "Sticky header with reordered navigation (About first), resume CTA, and LinkedIn link using smooth scrolling.",
  "frontend/src/content/assets.json": "Defines static asset metadata, currently only a resume PDF entry.",
  "frontend/src/content/caseStudies.json": "Provides structured content for case studies including metadata, images, and sectioned text.",
  "frontend/src/content/contact.json": "Contains contact information such as email and LinkedIn URL.",
  "frontend/src/content/projects.json": "Lists project summaries used for the Selected Work section, including titles, descriptions, and thumbnails.",
  "frontend/src/content/siteContent.json": "Stores hero text, value propositions, and about content for the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and identity management.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects whether the user prefers reduced motion via a media query.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Checks if a static asset exists by issuing a HEAD request and exposes availability state.",
  "frontend/src/index.css": "Re-exports base CSS from a parent index.css file.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CaseStudyPage.tsx": "Displays a full case study page with images, sections, and back navigation, using scroll animations.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page layout with header, footer, and multiple content sections, passing navigation handling to SelectedWorkSection. It serves as the main entry page for the portfolio site.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme values. It enables plugins and defines design tokens used across the frontend.",
  "project_state.json": "Stores the project’s state, requirements, features, and architectural notes for building the portfolio site. Acts as metadata guiding implementation and content integration."
}