{
  "backend/main.mo": "Defines an actor storing uploaded project files and CV URLs with functions to add and query them.",
  "backend/migration.mo": "Provides a migration converting old project and resume maps into the new uploadedFiles and uploadedCVs structures.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables, typography, and utility classes for light/dark modes.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component switching between landing and case‑study views with smooth‑scroll navigation.",
  "frontend/src/components/site/ContactLinks.tsx": "Renders email, resume, and LinkedIn buttons using contact JSON and ResumeCta.",
  "frontend/src/components/site/Motion.tsx": "RevealOnScroll component animating elements into view using IntersectionObserver with reduced‑motion support.",
  "frontend/src/components/site/Primitives.tsx": "Provides Section and Container layout components with consistent spacing and max‑width.",
  "frontend/src/components/site/ResumeCta.tsx": "Resume button that checks asset availability and disables itself if the PDF is missing.",
  "frontend/src/components/site/sections/AboutSection.tsx": "About section showing bio content with scroll‑reveal animation.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Hero section with headline, description, CTAs, and background imagery using siteContent JSON.",
  "frontend/src/components/site/sections/LetsTalkSection.tsx": "Contact section with intro text and action links wrapped in scroll‑reveal.",
  "frontend/src/components/site/sections/SelectedWorkSection.tsx": "Renders project list as interactive cards that navigate to case studies with animated reveal.",
  "frontend/src/components/site/sections/ValuePropsSection.tsx": "Renders a value‑propositions section using siteContent.json, displaying a heading and a grid of items with scroll‑reveal animations.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer displaying copyright text and a caffeine.ai attribution link.",
  "frontend/src/components/site/SiteHeader.tsx": "Sticky header providing smooth‑scroll navigation and resume/LinkedIn actions.",
  "frontend/src/content/assets.json": "Defines static asset metadata for the site, currently including a resume PDF with its path and labels.",
  "frontend/src/content/caseStudies.json": "Contains structured case‑study data including slugs, titles, clients, images, and section content for detailed project pages.",
  "frontend/src/content/contact.json": "Provides basic contact information such as email and LinkedIn URL.",
  "frontend/src/content/projects.json": "Lists high‑level project summaries with slugs, titles, client info, descriptions, and thumbnails.",
  "frontend/src/content/siteContent.json": "Holds site‑wide content such as hero text, value proposition items, and about information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for Internet Identity login, state management, and AuthClient configuration.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Checks the user's reduced‑motion preference via a media query and updates reactively.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Checks if a static asset exists by issuing a HEAD request and returns availability status.",
  "frontend/src/index.css": "Re‑imports the root index.css file for styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and renders the App component.",
  "frontend/src/pages/CaseStudyPage.tsx": "Displays a full case‑study page with images, sections, and navigation, pulling structured data from caseStudies.json.",
  "frontend/src/pages/LandingPage.tsx": "Composes the homepage layout with hero, value props, work samples, about, and contact sections.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, content paths, and extensive theme extensions for colors, typography, spacing, radii, and shadows with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing goals, architecture notes, known issues, and a list of existing features with versioned requirements for the portfolio site."
}