{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Landing page section reorder, portfolio image integration, and refreshed leadership positioning copy",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Reorder landing-page sections so About appears before Selected Work, and make “About” the first header nav item while keeping smooth scrolling intact.",
      "acceptanceCriteria": [
        "On the landing page, the About section renders before the Selected Work section in the scroll order.",
        "In the desktop header navigation, the first nav item is “About” and it smoothly scrolls to the About section.",
        "Work and Contact navigation items still smoothly scroll to their respective sections and remain functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Reorder the section composition so <AboutSection /> renders above <SelectedWorkSection /> while keeping existing section ids and page wiring intact."
        },
        {
          "path": "frontend/src/components/site/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the desktop header navigation button order so “About” appears first, while preserving smooth-scroll behavior and ensuring Work and Contact still scroll to their existing section ids."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add portfolio images as static frontend assets and wire them into Selected Work thumbnails and case study pages with clean, minimal presentation and proper alt text.",
      "acceptanceCriteria": [
        "Relevant portfolio images are added to the frontend as static assets (not fetched from the backend) and are referenced from content/config where appropriate.",
        "Selected Work project cards display updated thumbnails where portfolio images are available and relevant.",
        "Case study pages include relevant images from the portfolio file, presented in a clean, minimal layout consistent with the existing design system.",
        "All added images include appropriate alt text and do not break layout on mobile or desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/portfolio/.gitkeep",
          "operation": "create",
          "description": "Create a dedicated static asset directory for the provided portfolio images (to be placed alongside this marker file) so they can be referenced by the landing page and case studies without any backend fetching."
        },
        {
          "path": "frontend/src/content/projects.json",
          "operation": "modify",
          "description": "Update project thumbnail paths to point at the new static portfolio images under frontend/public/assets/portfolio (where relevant), ensuring each project card uses an appropriate, available image."
        },
        {
          "path": "frontend/src/content/caseStudies.json",
          "operation": "modify",
          "description": "Extend case study content to reference relevant static portfolio images (e.g., add per-case-study or per-section image fields with src + alt) using paths under frontend/public/assets/portfolio."
        },
        {
          "path": "frontend/src/pages/CaseStudyPage.tsx",
          "operation": "modify",
          "description": "Render referenced case study images from caseStudies.json in a clean, minimal layout (responsive, consistent spacing/typography), ensuring alt text is applied and the layout remains stable on mobile and desktop."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Slightly reword the provided strategic/product leadership positioning and incorporate it into hero, value props, and/or about content in English with a modern/minimal tone.",
      "acceptanceCriteria": [
        "The site’s hero/about/value-prop copy is updated to reflect the provided leadership themes with slight rewording (no verbatim copy dumps).",
        "The updated copy reads naturally as a portfolio positioning statement for Manvi Drona and remains consistent with the site’s modern/minimal tone.",
        "No user-facing text is added in any language other than English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteContent.json",
          "operation": "modify",
          "description": "Revise hero subhead/description and refresh About and Value Props copy to incorporate the provided strategic architect/product leadership themes with slight rewording (English-only), keeping the site’s existing modern/minimal voice."
        },
        {
          "path": "frontend/src/components/site/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "If needed for best on-page impact and readability, make small presentational adjustments to how the updated hero copy is displayed (without changing overall theme), continuing to source text from siteContent.json."
        },
        {
          "path": "frontend/src/components/site/sections/AboutSection.tsx",
          "operation": "modify",
          "description": "Ensure the updated About positioning copy from siteContent.json reads well in the About section layout (line length/spacing), maintaining the existing minimal styling and English-only content."
        },
        {
          "path": "frontend/src/components/site/sections/ValuePropsSection.tsx",
          "operation": "modify",
          "description": "Ensure the updated leadership-oriented value prop titles/descriptions from siteContent.json render cleanly within the existing responsive grid and remain consistent with the site’s tone (English-only)."
        }
      ]
    }
  ]
}